[{"Number":1,"English":"Ar Rahmaan","Arabic":"الرَّحْمَنُ","Meaning":"The Beneficent","Description":"He who wills goodness and mercy for all His creatures"},{"Number":2,"English":"Ar Raheem","Arabic":"الرَّحِيمُ","Meaning":"The Merciful","Description":"He who acts with extreme kindness "},{"Number":3,"English":"Al Malik","Arabic":"الْمَلِكُ","Meaning":"The King / Eternal Lord","Description":"The Sovereign Lord, The One with the complete Dominion, the One Whose Dominion is clear from imperfection "},{"Number":4,"English":"Al Quddus","Arabic":"الْقُدُّوسُ","Meaning":"The Purest","Description":"The One who is pure from any imperfection and clear from children and adversaries"},{"Number":5,"English":"As Salaam","Arabic":"السَّلاَمُ","Meaning":"The Source of Peace","Description":"The one who provides peace, calm and serenity. By citing this name, we declare peace for ourselves and for those around us."},{"Number":6,"English":"Al Mu'min","Arabic":"الْمُؤْمِنُ","Meaning":"The inspirer of faith","Description":"This name is mysterious even for Muslims because \\\"Al-Mu'min\\\" comes from the name \\\"Al-iman\\\" which means to believe, from where comes the name \\\"Al-Mu'minoune\\\" which means believers, it is is the name of the Koran for people who believe in 6 things: the oneness of God, the existence of angels, holy books (Torah, Gospel and Psalms (Zabor) unmodified and the Koran), the prophets, the last day (the day of judgment) and fate its evil and its good. The exact meaning of this name is very difficult to pin down in its original meaning but can be understood from a deeper and more mystical point of view."},{"Number":7,"English":"Al Muhaymin","Arabic":"الْمُهَيْمِنُ","Meaning":"The Guardian","Description":"Whoever dominates His creation and by His omnipotence in all aspects, no state or aspect in this world or the other escapes His will."},{"Number":8,"English":"Al Azeez","Arabic":"الْعَزِيزُ","Meaning":"The Precious / The Most Mighty","Description":"The Glorious by His supremacy and His greatness, El-Aziz means in a sense the one who is dear and precious in the eyes of His creatures. He is not the servant of any creature, and no creature dictates to him what to do."},{"Number":9,"English":"Al Jabbaar","Arabic":"الْجَبَّارُ","Meaning":"The Compeller","Description":"The grandiose, the ultimate powerful by His greatness and His unlimited strength. When He destroys the oppressors (unjust and sinners) He applies His sentence with righteousness."},{"Number":10,"English":"Al Mutakabbir","Arabic":"الْمُتَكَبِّرُ","Meaning":"The Greatest","Description":"He who is superior to His creatures, no creature has the right to claim greatness."},{"Number":11,"English":"Al Khaaliq","Arabic":"الْخَالِقُ","Meaning":"The Creator","Description":"The Creator of all existences, living or dead, mobile or frozen."},{"Number":12,"English":"Al Baari","Arabic":"الْبَارِئُ","Meaning":"The Maker of Order","Description":"He who lifts His creation above all faults or imperfections."},{"Number":13,"English":"Al Musawwir","Arabic":"الْمُصَوِّرُ","Meaning":"The Shaper of Beauty","Description":"The one who gives the look and the appearance to each creation from the inside as well as from the outside. In lost Arabic, literally, this word means sculptor and, in modern Arabic, literally means designer."},{"Number":14,"English":"Al Ghaffaar","Arabic":"الْغَفَّارُ","Meaning":"The Forgiving","Description":"Is the One who forgives what He wants to whom He wants."},{"Number":15,"English":"Al Qahhaar","Arabic":"الْقَهَّارُ","Meaning":"The Subduer","Description":"Is the One who is almighty to submit all creation to His will."},{"Number":16,"English":"Al Wahhaab","Arabic":"الْوَهَّابُ","Meaning":"The Giver of All","Description":"Is the One who gives immensely without receiving anything in return"},{"Number":17,"English":"Ar Razzaaq","Arabic":"الرَّزَّاقُ","Meaning":"The Sustainer","Description":"Is the One who makes distribute to every creature what it needs."},{"Number":18,"English":"Al Fattaah","Arabic":"الْفَتَّاحُ","Meaning":"The Opener","Description":"Is He Who alone knows the keys to the future and the unknown, by His knowledge and by His wisdom. This name is often associated with the following name \"Al-‘Alīm\"."},{"Number":19,"English":"Al 'Aleem","Arabic":"اَلْعَلِيْمُ","Meaning":"The Knower of all","Description":"The one from whom nothing can hide, for He knows everything and is aware of everything."},{"Number":20,"English":"Al Qaabid","Arabic":"الْقَابِضُ","Meaning":"The Constrictor","Description":"Is the One who restricts His good according to wisdom."},{"Number":21,"English":"Al Baasit","Arabic":"الْبَاسِطُ","Meaning":"The Reliever","Description":"Is the One who frees, increases and multiplies his good according to wisdom."},{"Number":22,"English":"Al Khaafid","Arabic":"الْخَافِضُ","Meaning":"The Abaser","Description":"Is the One who destines the oppressors and the proud to demeanor and chastisement."},{"Number":23,"English":"Ar Raafi'","Arabic":"الرَّافِعُ","Meaning":"The Exalter","Description":"The Breeder in the sense of raising, the one who elevates the honor, the status and the prestige of a being in this lower world and in the hereafter."},{"Number":24,"English":"Al Mu'iz","Arabic":"الْمُعِزُّ","Meaning":"The Bestower of Honour","Description":"One who offers honor and precious value."},{"Number":25,"English":"Al Mudhil","Arabic":"المُذِلُّ","Meaning":"The Humiliator","Description":"Is the One who can humiliate and devalue any valiant."},{"Number":26,"English":"As Samee'","Arabic":"السَّمِيعُ","Meaning":"The Hearer of all","Description":"One who hears any noise or sound in His kingdom emanating from any creature and also One who listens to the invocations of His creatures to respond to their invocations."},{"Number":27,"English":"Al Baseer","Arabic":"الْبَصِيرُ","Meaning":"The Seer of all","Description":"Is the One from whom nothing that exists or comes into existence can escape without the slightest use of an eye, instrument or organ."},{"Number":28,"English":"Al Hakam","Arabic":"الْحَكَمُ","Meaning":"The Judge","Description":"He is the One who judges and decides between creatures here below and in the hereafter and He who ensures equity between the creatures and no one else will and will not be able to decide between them and judge them; and the Judgment in the hereafter will be perfectly just and appropriate."},{"Number":29,"English":"Al 'Adl","Arabic":"الْعَدْلُ","Meaning":"The Just","Description":"Is the One who is free from all forms of injustice and / or oppression."},{"Number":30,"English":"Al Lateef","Arabic":"اللَّطِيفُ","Meaning":"The Subtle One","Description":"Is the One who grants his creatures His gentleness and His benevolence."},{"Number":31,"English":"Al Khabeer","Arabic":"الْخَبِيرُ","Meaning":"The All Aware","Description":"He is the One from whom cannot be hidden the reality of everything that exists, that is to say the truth of things; no detail escapes Him, neither the thing as a whole, nor each of its parts; and to claim to be able to hide things from the One who creates everything is a delusion and a disbelief."},{"Number":32,"English":"Al Haleem","Arabic":"الْحَلِيمُ","Meaning":"The Forebearing","Description":"Is the One whose patience towards the disbeliefs of sinners exceeds all imagination (it is possible that forgiveness will be granted to them)."},{"Number":33,"English":"Al 'Azeem","Arabic":"الْعَظِيمُ","Meaning":"The Maginificent","Description":"This name is difficult to translate because it includes several French words that do not share the same spiritual meaning, but it can be approached as follows: \"Al-Adhīm\" He who is Gigantic Majestic and Fantastically Grandiose far from any bodily or material imperfection"},{"Number":34,"English":"Al Ghafoor","Arabic":"الْغَفُورُ","Meaning":"The Great Forgiver","Description":"Is the One who forgives immensely over and over again."},{"Number":35,"English":"Ash Shakoor","Arabic":"الشَّكُورُ","Meaning":"The Rewarder of Thankfulness","Description":"Is the One who shows His gratitude for worshipers, however incredibly easy to perform."},{"Number":36,"English":"Al 'Aliyy","Arabic":"الْعَلِيُّ","Meaning":"The Highest","Description":"Is the One who is above all that He created perfectly and unimaginably."},{"Number":37,"English":"Al Kabeer","Arabic":"الْكَبِيرُ","Meaning":"The Greatest","Description":"The Great: One who is greater than His creation, a greatness that only He knows."},{"Number":38,"English":"Al Hafeez","Arabic":"الْحَفِيظُ","Meaning":"The Preserver","Description":"Is the One who protects and preserves His good."},{"Number":39,"English":"Al Muqeet","Arabic":"المُقيِت","Meaning":"The Sustainer","Description":"this word is among the lost words of the ancient Arabic language; very difficult to translate even in modern Arabic}. It would mean: Is the One who leaves no detail when He judges, even the most trivial."},{"Number":40,"English":"Al Haseeb","Arabic":"الْحسِيبُ","Meaning":"The Reckoner, The Sufficient","Description":"He is the One who will count all the facts of His creatures without forgetting or error."},{"Number":41,"English":"Al Jaleel","Arabic":"الْجَلِيلُ","Meaning":"The Majestic","Description":"Is the One who is perfectly exempt from being compared to His creatures or from being like Him."},{"Number":42,"English":"Al Kareem","Arabic":"الْكَرِيمُ","Meaning":"The Most Generous, The Most Esteemed","Description":"Is the One who flooded His creation with His generosity."},{"Number":43,"English":"Ar Raqeeb","Arabic":"الرَّقِيبُ","Meaning":"The Watchful One","Description":"Is the One who observes and beholds all that He has created (and the actions of creatures are also creations)."},{"Number":44,"English":"Al Mujeeb ","Arabic":"الْمُجِيبُ","Meaning":"The Responder to Prayer","Description":"Is the One who answers the invocations of His creatures if He wills and to whom He wills."},{"Number":45,"English":"Al Waasi'","Arabic":"الْوَاسِعُ","Meaning":"The All-Encompassing, the Boundless","Description":"This name in Arabic means: immensely wide, but to qualify God it is understood that He has filled every void and has contained all things in a way that only He knows."},{"Number":46,"English":"Al Hakeem","Arabic":"الْحَكِيمُ","Meaning":"The Perfectly Wise","Description":"He whose Wisdom has dazzled, dazzled and will dazzle any conscious and intelligent mind."},{"Number":47,"English":"Al Wudood","Arabic":"الْوَدُودُ","Meaning":"The Most Loving","Description":"This word in Arabic means: The one who draws near to his beloved by mercy, pity and beneficence, but when one reads this name in the \"Koran\", one feels each time different meanings which are difficult to translate into words}. We can try to translate it: The one who draws near to His servants out of pity although they move away from Him and do not glorify Him."},{"Number":48,"English":"Al Majeed","Arabic":"الْمَجِيدُ","Meaning":"The Glorious One, The Most Honorable","Description":"Is the One who is glorified in the infinitely past, present and eternal."},{"Number":49,"English":"Al Baa'ith","Arabic":"الْبَاعِثُ","Meaning":"The Resurrector","Description":"Is the One who raises the dead and deploys life in whatever He wants, be they men, animals or simply earth."},{"Number":50,"English":"Ash Shaheed","Arabic":"الشَّهِيدُ","Meaning":"The Witness","Description":"Le T\\u00E9moin : Allah est l'ultime et parfait t\\u00E9moin de tout ce qui s'est pass\\u00E9 dans Son royaume, avec des preuves claires et flagrantes, parfaitement irr\\u00E9prochables."},{"Number":51,"English":"Al Haqq","Arabic":"الْحَقُّ","Meaning":"The Truth","Description":"Is the One who holds the absolute Truth."},{"Number":52,"English":"Al Wakeel","Arabic":"الْوَكِيلُ","Meaning":"The Trustee","Description":"Is the One who guarantees the sustenance of creatures and the One from whom nothing of their every state can be concealed"},{"Number":53,"English":"Al Qawiyy","Arabic":"الْقَوِيُّ","Meaning":"The Possessor of all strength","Description":"The Mighty: Allah is the most powerful, the strongest, his strength has no limit and is not described with definitions of physical strength."},{"Number":54,"English":"Al Mateen","Arabic":"الْمَتِينُ","Meaning":"The Forceful","Description":"The Enduring: An endurance worthy of Him, unlimited, indefatigable, and which is not marred by any weakness, without pause, without interruption and which no factor can attenuate."},{"Number":55,"English":"Al Waliyy","Arabic":"الْوَلِيُّ","Meaning":"The Protector","Description":"Is the One who preserves the believing servants, so the prophets and those who follow them are those who are the \"preserved people\" in the sense that they have been guided to the obligatory thanks to Him who makes them exist, that is, that is to say with regard to Allah"},{"Number":56,"English":"Al Hameed","Arabic":"الْحَمِيدُ","Meaning":"The Praised","Description":"Is the One who deserves the thanksgiving, the glorification and the song of praise more than any other"},{"Number":57,"English":"Al Muhsi","Arabic":"الْمُحْصِي","Meaning":"The All-Enumerating, The Counter","Description":"Literally translated as the counter but means the One who counts every creature, every act, every speck of dust in his kingdom and of whom nothing escapes his knowledge"},{"Number":58,"English":"Al Mubdi","Arabic":"الْمُبْدِئُ","Meaning":"The Originator","Description":"Is the One who gives a beginning to what does not exist without a beginning, without a model, that is to say, the One who creates creatures"},{"Number":59,"English":"Al Mu'eed","Arabic":"الْمُعِيدُ","Meaning":"The Restorer","Description":"Is the One who brings the living back to death after life and the One who brings the dead back to life after death"},{"Number":60,"English":"Al Muhiy","Arabic":"الْمُحْيِي","Meaning":"The Giver of life","Description":"Is the One who gives life to a mixture of maniyy, that is to say of seminal liquid, devoid of soul and makes him a living being and the One who gives life to the bodies of humans, jinns and angels by reuniting them with their souls during the resurrection"},{"Number":61,"English":"Al Mumeet","Arabic":"اَلْمُمِيتُ","Meaning":"The Taker of life","Description":"He is the One who kills living beings and the One who cancels out the power of the powerful of this world by death"},{"Number":62,"English":"Al Haiyy","Arabic":"الْحَيُّ","Meaning":"The Ever Living","Description":"The Living One: Is the One who does not come into existence and yet exists, and the One who possesses a hayah and this attribute is not a life as is the hayah of creatures made up of a combination of soul, flesh and of blood Imam At-Tahawiyy said in his treatise on belief that \"he who attributes to Allah an attribute in a sense which is among those which can be attributed to human beings is disbeliever\""},{"Number":63,"English":"Al Qayyoom","Arabic":"الْقَيُّومُ","Meaning":"The Self Existing","Description":"Is the One who exists, is eternal and does not change and the One who is not affected by non-existence or annihilation and is in no way affected by controlling and creating the acts of human beings"},{"Number":64,"English":"Al Waajid","Arabic":"الْوَاجِدُ","Meaning":"The Perceiver","Description":"Is the One who does not need anything and is not reached or concerned with want, lack or need"},{"Number":65,"English":"Al Maajid","Arabic":"الْمَاجِدُ","Meaning":"The Glorious","Description":"Is the One who is better than any other and the One who bestows innumerable benefits very widely and without compensation"},{"Number":66,"English":"Al Waahid","Arabic":"الْواحِدُ","Meaning":"The Only One","Description":"The Unique: Is the One who has no alter ego, whether in His Being, in His Act, or in His Attributes. Nothing is like him"},{"Number":67,"English":"Al Ahad","Arabic":"اَلاَحَدُ","Meaning":"The One","Description":"The One: Is He Who has uniqueness as an attribute"},{"Number":68,"English":"As Samad","Arabic":"الصَّمَدُ","Meaning":"The Supreme Provider","Description":"Is the One to whom we can rely for any business and who can be called upon for all our needs; One who has no children or parents, neither like nor equivalent, according to Al-Hakim's explanation; The One who needs nothing and the One who everything needs, in order to exist, etc."},{"Number":69,"English":"Al Qaadir","Arabic":"الْقَادِرُ","Meaning":"The Powerful","Description":"Is the One who is unaffected by weakness, the One whose power is absolute and dominates all creatures and the One whom absolutely nothing can weaken"},{"Number":70,"English":"Al Muqtadir","Arabic":"الْمُقْتَدِرُ","Meaning":"The Creator of all power","Description":"Is the One who is mighty over all things and the One whose capacities are absolutely limitless"},{"Number":71,"English":"Al Muqaddim","Arabic":"الْمُقَدِّمُ","Meaning":"The Expediter","Description":"Is He who is free from the characteristics of creatures and better than any creature; He who fixes the speed of events, accelerates certain things in the eyes of people according to a destiny and grants each thing a value, a rank, a time and characteristics which suit Him according to wisdom"},{"Number":72,"English":"Al Mu’akhir","Arabic":"الْمُؤَخِّرُ","Meaning":"The Delayer","Description":"Is He who is free from the characteristics of creatures and better than any creature; The one who intends the slowness of events and slows down certain things in the eyes of people according to a destiny and grants each thing a value, a rank, a time and characteristics which suit it according to a wisdom (cf no 71)"},{"Number":73,"English":"Al Awwal","Arabic":"الأوَّلُ","Meaning":"The First","Description":"The First: Is the One who exists without creatures, without beginning and without time; One who is exempt from being created, from the appearance of a new attribute and from change, One who exists without coming into existence"},{"Number":74,"English":"Al Aakhir","Arabic":"الآخِرُ","Meaning":"The Last","Description":"The Last: Is the One who exists without interruption while the creatures are annihilated at every moment; He who is eternal, He who annihilates and is exempt from being annihilated and the disappearance of one or more attributes; The one that exists without being concerned by the notion of end and annihilation"},{"Number":75,"English":"Az Zaahir","Arabic":"الظَّاهِرُ","Meaning":"The Manifest","Description":"Is the One whose existence is manifested in everything by proofs, from the point of view of power and domination and not what would be present in any body from the point of view of place, image and how"},{"Number":76,"English":"Al Baatin","Arabic":"الْبَاطِنُ","Meaning":"The Hidden","Description":"Is the One who is preserved from the delusions of creatures attempting to attribute to the Creator human characteristics or characteristics of creatures and the One who creates the characteristics of creatures and their images"},{"Number":77,"English":"Al Waali","Arabic":"الْوَالِي","Meaning":"The Governor","Description":"Is the One who owns, manages and controls all things and the One who creates everything according to wisdom"},{"Number":78,"English":"Al Muta’ali","Arabic":"الْمُتَعَالِي","Meaning":"The Supreme One","Description":"Is the One who is free from the attributes of creatures and the One whose power over creatures is boundless"},{"Number":79,"English":"Al Barr","Arabic":"الْبَرُّ","Meaning":"The Doer of Good","Description":"Is the One who has the ability to bestow faith and blessings on all creatures, and among them some are grateful and some are not: the former are called Muslims or believers and others are called non-Muslims or non-Muslims. -believers"},{"Number":80,"English":"At Tawwaab","Arabic":"التَّوَابُ","Meaning":"The Guide to Repentence","Description":"Is the One who grants forgiveness to those who repent every time they repent"},{"Number":81,"English":"Al Muntaqim","Arabic":"الْمُنْتَقِمُ","Meaning":"The Avenger","Description":"Is the avenger"},{"Number":82,"English":"Al Afuww","Arabic":"العَفُوُّ","Meaning":"The Forgiver","Description":"Is the One who sets aside and forgives sin and the One who preserves in every seemingly hopeless situation a door to honor, maintenance and blessings or to immediate repentance"},{"Number":83,"English":"Ar Ra’oof","Arabic":"الرَّؤُوفُ","Meaning":"The Most Kind","Description":"Is the One who can offer an immensity of benefits without counterpart and without necessity"},{"Number":84,"English":"Maalik Ul Mulk","Arabic":"مَالِكُ الْمُلْكِ","Meaning":"The Owner / Soverign of All","Description":"Is the One who creates and attributes according to a destiny all sovereignty, domination, property and all broad power which are granted to certain creatures in this lower world"},{"Number":85,"English":"Dhu Al Jalaali Wa Al Ikraam","Arabic":"ذُوالْجَلاَلِ وَالإكْرَامِ","Meaning":"Possessor of Majesty and Bounty","Description":"That is, Allah is the One who is better than any other in reality and all the evidence confirms this and denies the contrary so it is not valid to dispute this point, to deny it or to be hostile against this subject; is the One who fills with blessings those who will have understood this who will know the general holiness, will have success and will be well guided on the Day of Judgment"},{"Number":86,"English":"Al Muqsit","Arabic":"الْمُقْسِطُ","Meaning":"The Equitable One","Description":"Is the One who judges according to the greatest justice, the One who is free from all forms of injustice and tyranny, and the One who has absolutely no accountability"},{"Number":87,"English":"Al Jaami'","Arabic":"الْجَامِعُ","Meaning":"The Gatherer","Description":"Is the One who gathers creatures together on a day of which there is no doubt, the Day of Judgment"},{"Number":88,"English":"Al Ghaniyy","Arabic":"الْغَنِيُّ","Meaning":"The Rich One","Description":"Is the One who has no need of creatures and whose creatures cannot do without al-Ghaniyy [who is the One who makes them exist and keeps them in existence and constantly changes them]"},{"Number":89,"English":"Al Mughi","Arabic":"الْمُغْنِي","Meaning":"The Enricher","Description":"Is the One who satisfies the needs of creatures and the One who brings them their sustenance"},{"Number":90,"English":"Al Maani'","Arabic":"اَلْمَانِعُ","Meaning":"The Preventer of harm","Description":"Is the One who intends for each creature his victories, his protections and the One from whom they must always be preserved according to a destiny"},{"Number":91,"English":"Ad Daaarr","Arabic":"الضَّارَّ","Meaning":"The Creator of the harmful","Description":"Is the One who is almighty to bring inevitably the nuisance which must reach a creature according to a destiny"},{"Number":92,"English":"An Naafi’","Arabic":"النَّافِعُ","Meaning":"The Bestower of Benefits","Description":"Is the One who is almighty to bring inevitably the profit that a creature must receive according to a destiny"},{"Number":93,"English":"An Noor","Arabic":"النُّورُ","Meaning":"The Light","Description":"The Light: Is the One who guides to their goal those who are prey to temptation and puts them in the right direction according to a destiny; Allah is the One who guides believers to the light of faith, creates light and is not a light that is only a creature"},{"Number":94,"English":"Al Haadi","Arabic":"الْهَادِي","Meaning":"The Guider","Description":"Is the One who intends for certain creatures the benefit of being well guided and of knowing righteousness"},{"Number":95,"English":"Al Badi'","Arabic":"الْبَدِيعُ","Meaning":"The Incomparable Originator","Description":"Is the One who brings creatures and this world into existence, not from pre-existing matter or in the image of an earlier model, but on the contrary without precursor, model and unprecedented"},{"Number":96,"English":"Al Baaqi","Arabic":"اَلْبَاقِي","Meaning":"The Everlasting One","Description":"Is the One whose existence free from annihilation and change is imposed on sound reason which cannot claim the contrary"},{"Number":97,"English":"Al Waarith","Arabic":"الْوَارِثُ","Meaning":"The Inhertior","Description":"Is the One who exists and does not change as creatures are wiped out"},{"Number":98,"English":"Ar Rasheed","Arabic":"الرَّشِيدُ","Meaning":"The Most Righteous Guide","Description":"Is the One who guides creatures to what is in their best interests"},{"Number":99,"English":"As Saboor","Arabic":"الصَّبُورُ","Meaning":"The Patient One","Description":"Is the One who delays the punishment of sinners by adjusting the accounts of each until a definite day and gives them their ease and time until a time of which they all do not know the date."}]